app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.order("created_at DESC").page(params[:page]).per(4)
---
SELECT  `tweets`.* FROM `tweets` ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `tweets`

  def create
    Tweet.create(name: tweet_params[:name], image: tweet_params[:image], text: tweet_params[:text])
---
INSERT INTO `tweets` (`name`, `text`, `image`, `created_at`, `updated_at`) VALUES ('kome', 'cat', 'http://corobuzz.com/wp-content/uploads/2014/09/hk4.jpg', '2019-06-29 15:10:16', '2019-06-29 15:10:16')

  def destroy
    tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1